// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "代理服务器设置";
HSDTaskDescription = "打印机支持连接 Internet。如果使用代理服务器连接 Internet，则配置下面设置。";
TaskDescriptionInAssistantMode = "要连接到 HP Web 服务，您的打印机需要连接 Internet。如果使用代理服务器连接 Internet，请在下面输入其设置。\n\n如果不清楚您的代理设置，请参阅“网络首选项”窗格中的设置，或者与系统管理员联系。";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "无需代理服务器连接Internet";
HSDAutomaticProxySettingsTitle = "自动(设备将自动检测设置)";
HSDCustomProxySettingsTitle = "自定义代理服务器配置:";
HSDSystemProxySettingsTitle = "复制系统设置";

// Proxy server settings
HSDProxyServerTitle = "代理服务器：";
ProxyPortTitle = "代理端口:";

// Authentication
HSDRequiresAuthenticationButton = "代理服务器需要鉴定";
HSDUserNameTitle = "用户名：";
HSDPasswordTitle = "密码：";

HSDApplyNowButtonTitle = "现在应用";

// progress titles
UpdateInformationProcessTitle = "正在更新信息...";

// alerts
EmptyProxyServerOrPortErrorText = "必须指定代理服务器和代理端口。";

EmptyUserNameOrPasswordErrorText = "代理服务器鉴定需要指定用户名和密码。";

IncorrectProxyServerNameFormatErrorText = "无法设置代理服务器名称。请检查格式是否有效。";

HSDUserNameTooLargeErrorText = "用户名过长。您的设备支持最多 %d 个字符的用户名。";
